given_data_root_path = "D:\\University\\2020\\Fall 2020\\NLP\\assignments\\1\\corpus\\"
document_root_path = "D:\\Dev\\NLP\\first_assignment\\"
diacritics = '[‌|‮|‫|⁩|⁧|्ۭۤिۗੱٗਿٰٞۚٓ°▫:::::`▪̋ˆˈʿًٌٍَُِّءۙ˝ْٖۢٔۖۡ]'
punctuations = '[!"#$%&\'()٭*+-/;<=>@[\\]_{|}~£©«®±»†…•←−≠▌▐▬◊●◾♥♦✅✔➡《》口员⁧⁩子宇平日本椅火‌窗箭航面곤쌍절￼�🔴‌🔶🔸🔹🖋🥇🥈🥉⁦‹›⁄É×àáãäçèéêëìïñóö÷ûüý\\\ĀčěğİıłŞŠḤṣ–—Ẓū،‘’“”؛٪٫٬]'

zero_space = u'\u200C|\u200B|\uFEFF|\u180E'
space = u'\u0020|\u00A0|\u2002|\u2003|\u2004|\u2005|\u2006|\u2007|\u2008|\u2009|\u200A\u202F|\u205F|\u3000|\u1D7FF|\u1DA80|\u1DA7F|\uE0020'

colon = u'\u003A|\u02D0|\u02F8|\u0703|\u0704|\u0705|\u0706|\u0707|\u0709|\u1804|\u2982|\uA789|\uFE13|\uFE55|\uFF1A|\u003A'

frequency_limitation = 10000

law_limit = 5000

sentences_avg_length = 31